<a href="https://colab.research.google.com/github/JeisonTantachuco/curso-series-temporales/blob/master/2.%20Serie%20temporal%20en%20R%20y%20Python/Python/2_Python_Objeto_serie_temporal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Importing the Packages

In [14]:
import pandas as pd
import numpy as np

### Importing the data

In [15]:
raw_csv_data = pd.read_csv("https://raw.githubusercontent.com/JeisonTantachuco/curso-series-temporales/master/1.%20Introduccion%20a%20las%20series%20temporales/Python/Index2018.csv") 
df_comp=raw_csv_data.copy()

### Lenght of the Time Period

In [16]:
df_comp.describe()

               spx           dax         ftse        nikkei
count  6269.000000   6269.000000  6269.000000   6269.000000
mean   1288.127542   6080.063363  5422.713545  14597.055700
std     487.586473   2754.361032  1145.572428   4043.122953
min     438.920000   1911.700000  2876.600000   7054.980000
25%     990.671905   4069.350000  4486.100000  10709.290000
50%    1233.420000   5773.340000  5662.430000  15028.170000
75%    1459.987747   7443.070000  6304.250000  17860.470000
max    2872.867839  13559.600000  7778.637689  24124.150000

In [17]:
df_comp.head()

         date     spx      dax     ftse    nikkei
0  07/01/1994  469.90  2224.95  3445.98  18124.01
1  10/01/1994  475.27  2225.00  3440.58  18443.44
2  11/01/1994  474.13  2228.10  3413.77  18485.25
3  12/01/1994  474.17  2182.06  3372.02  18793.88
4  13/01/1994  472.47  2142.37  3360.01  18577.26

In [18]:
df_comp.date.describe() #obligamos que nos haga un describe a la variable fecha
#nos dice cuantos valores hay, cuantos valores unicos
#Python ve la columna de estos datos como un string, no como una fecha, por eso en "top" simplemente pone un valor cualquiera
#porque entiende que todos los valores de dicha columna son iguales.

count           6269
unique          6269
top       27/06/2003
freq               1
Name: date, dtype: object

### From Text to Date

In [19]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst = True)
# convertiremos el tipo de dato a datetime
# dayfirst=True, ya que el método tradicionalmente lo pone como False, eso quiere decir que el primer número que leera será el mes luego el dia luego el año.
# Al ponerlo en True, estamos afirmando que nosotros tenemos los valores ordenados dia-mes-año

In [20]:
df_comp.head() #vemos que ahora la representación ha cambiado a año-mes-dia

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [21]:
df_comp.date.describe() #describiremos ahora la variable date
# ahora como ha cambiado a tipo fecha, la descripción sera correcta
# top sigue siendo una fecha cualquiera, sin embargo first nos indica la primera fecha y last la última

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the Index

In [22]:
df_comp.set_index("date", inplace=True)
# Colocaremos la columna date (de fechas), como indice para al plotear salga en el eje X
# inplace=True, para que la columna date quede como índice, y no lo considere nuevamente como valor

In [23]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

In [24]:
#df_comp.date.describe() #Expect to get an error message because we no longer have a "date" column since it is the index
# Nos botará un error ya que la columna date ya no pertenece al data frame como dato, sino está como índice.
# Y a un índice no se le puede aplicar el método describe.
# Tener en cuenta que antes de convertir a índice debemos verificar que todas las fechas estén bien escritas ya que como índice no puede haber una modificación

### Setting the Desired Frequency

In [25]:
df_comp=df_comp.asfreq('d') #Asignaremos la frecuencia para la serie
#Dentro del método sólo requiere un argumento
#h: hourly (horaria), w: weekly (semanal), d: daily (diaria), m: monthly (mensualmente), a: anual

In [26]:
df_comp.head() #Nos damos cuenta que antes nuestros datos empezaban el 7 de enero, y se pasaban al 10 de enero
#Por lo cual el método ha creado una fila para las filas 8 y 9 de enero con datos NaN, ya que debemos tener el mismo periodo de tiempo (frecuencia) 1 dia, 1 dia , 1 dia
#Misma frecuencia, se repetirá a lo largo de todo el dataframe

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-08     NaN      NaN      NaN       NaN
1994-01-09     NaN      NaN      NaN       NaN
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25

In [27]:
df_comp=df_comp.asfreq('b') #Ahora la opción b (bussiness date) significa que sólo tomará como frecuencia aquellos días que no sean festivos, fines desemana y no laborables

In [28]:
df_comp.head() #como podemos darnos cuenta esos días 8 y 9 de enero eran dias no laborales, festivos o fines de semana

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missing Values

In [29]:
df_comp.isna() #arreglo de booleanos de cada una de las columnas de todas las filas
#donde True: el dato es NA, en otras palabras falta datos
#False: si hay presencia de dato

              spx    dax   ftse  nikkei
date
1994-01-07  False  False  False   False
1994-01-10  False  False  False   False
1994-01-11  False  False  False   False
1994-01-12  False  False  False   False
1994-01-13  False  False  False   False
...           ...    ...    ...     ...
2018-01-23  False  False  False   False
2018-01-24  False  False  False   False
2018-01-25  False  False  False   False
2018-01-26  False  False  False   False
2018-01-29  False  False  False   False

[6277 rows x 4 columns]

In [30]:
df_comp.isna().sum() #suma de todos los valores para cada columna o variable
#Si existen missing values nos dará el un número diferente a 0 ya que True equivale a 1, es decir el número que nos arroje será el total de missing values en la variable o columna

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

Existen 8 fechas para las cuales no existen valores para cada una de las variables

In [31]:
df_comp

                    spx       dax         ftse    nikkei
date
1994-01-07   469.900000   2224.95  3445.980000  18124.01
1994-01-10   475.270000   2225.00  3440.580000  18443.44
1994-01-11   474.130000   2228.10  3413.770000  18485.25
1994-01-12   474.170000   2182.06  3372.020000  18793.88
1994-01-13   472.470000   2142.37  3360.010000  18577.26
...                 ...       ...          ...       ...
2018-01-23  2839.130362  13559.60  7731.827774  24124.15
2018-01-24  2837.544008  13414.74  7643.428966  23940.78
2018-01-25  2839.253031  13298.36  7615.839954  23669.49
2018-01-26  2872.867839  13340.17  7665.541292  23631.88
2018-01-29  2853.528411  13324.48  7671.533300  23629.34

[6277 rows x 4 columns]

In [32]:
df_comp.spx=df_comp.spx.fillna(method='ffill') #le va a asignar el valor del periodo próximo posterior (front filling)

In [33]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [34]:
df_comp.ftse=df_comp.ftse.fillna(method='bfill') #le va a asignar el valor del periodo próximo anterior(back filling)

In [35]:
df_comp.dax=df_comp.dax.fillna(value = df_comp.dax.mean()) #asignando el valor medio de la columna o varible dax a los valores faltantes del mismo

Para series temporales insertar la media no va a tener mucho sentido, porque en series de tiempo van a haber patrones y variaciones, sólo sería apropiado si realmente toda la serie fluctúa alrededor de la media. Ejem. Si hay tendencia (variable o constante), es decir, si no es estable alrededor de la media no tiene mucho sentido usar este método.

In [36]:
df_comp.nikkei=df_comp.dax.fillna(method='bfill')

In [37]:
df_comp.isna().sum() #ya ninguna de las variables tiene valores faltantes

spx       0
dax       0
ftse      0
nikkei    0
dtype: int64

### Simplifying the Dataset
Agregar o eliminar columnas de datos de un conjunto de variables de series de tiempo

A menudo terminamos analizando una sola frecuencia por sí sola, es decir una sola variable (en este caso el spx500). Entonces no nos interesa las otras series de tiempo (eliminaríamos las otras variables), por dos razones: la primera es que cuando menos datos carguemos más rápido manipularemos el dataset y la segunda razón es por claridad, soltar las 4 columnas hace que sea más facil el seguimiento de cada una de ellas.

In [38]:
df_comp['market_value']=df_comp.spx #guardaremos en una nueva columna los valores de spx

In [39]:
df_comp.describe()

               spx           dax         ftse        nikkei  market_value
count  6277.000000   6277.000000  6277.000000   6277.000000   6277.000000
mean   1288.642547   6080.063363  5423.690398   6080.063363   1288.642547
std     487.868210   2752.604984  1145.568370   2752.604984    487.868210
min     438.920000   1911.700000  2876.600000   1911.700000    438.920000
25%     992.715221   4070.460000  4487.880000   4070.460000    992.715221
50%    1233.761241   5774.380000  5663.300000   5774.380000   1233.761241
75%    1460.250000   7442.660000  6304.630175   7442.660000   1460.250000
max    2872.867839  13559.600000  7778.637689  13559.600000   2872.867839

In [40]:
del df_comp['spx'] #para eliminar la columna spx

In [41]:
df_comp.describe()

                dax         ftse        nikkei  market_value
count   6277.000000  6277.000000   6277.000000   6277.000000
mean    6080.063363  5423.690398   6080.063363   1288.642547
std     2752.604984  1145.568370   2752.604984    487.868210
min     1911.700000  2876.600000   1911.700000    438.920000
25%     4070.460000  4487.880000   4070.460000    992.715221
50%     5774.380000  5663.300000   5774.380000   1233.761241
75%     7442.660000  6304.630175   7442.660000   1460.250000
max    13559.600000  7778.637689  13559.600000   2872.867839

In [42]:
del df_comp['dax']
del df_comp['ftse']
del df_comp['nikkei']

In [43]:
df_comp.describe()

       market_value
count   6277.000000
mean    1288.642547
std      487.868210
min      438.920000
25%      992.715221
50%     1233.761241
75%     1460.250000
max     2872.867839

### Splitting the Data
División de datos en caso querramos aplicar las tecnicas de Machine Learnig (Entrenamiento y Testeo)

En un dataset usual, normalmente se barajarían aleatoriamente los datos, sin embargo,los datos en series temporales dependen de mantener un orden cronológico, entonces si barajamos perdemos el orden (relación temportal). Por lo tanto, no se puede barajear. El conjunto de entrenamiento y de prueba deben ser datos cronologicamente consecutivos.

In [44]:
size = int(len(df_comp)*0.8) #obteniendo la fila correspondiente al dato ubicado en el 80%

In [45]:
df = df_comp.iloc[:size] #sacando un subconjunto desde la primera fila hasta la fila que ocupa el orden 80%, así tendremos el 80% de datos en un subconjunto

In [46]:
df_test = df_comp.iloc[size:] #sacando un subconjunto a partir del orden 80% hasta el final de dato (teniendo el 20% de datos restantes para test)

In [47]:
df.tail() #ultimas filas del conjunto de entrenamiento

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [48]:
df_test.head() #primeras filas del conjunto de prueba #no hay solapamiento, es todo ok
#hay ausencia de datos para el 06 y 07 de abril, pero esos datos están ausentes ya que son días no laborales

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623